[
    {
      "id": 1,
      "title": "Crude",
      "slug": "crude",
      "typeOfWork": "UX/UI + Frontend Dev",
      "description": "Crude is a all-gender jewelry brand which needed an e-commerce to start selling online. For this project I programmed an online shop designed in Figma and developed in Woocommerce.",
      "linkToSite": "https://esatdev.com/2022/marina/crude/",
      "imagePathMobile": "/images/projects/crude/crude-website-mobile.webp",
      "imagePathDesktop": "/images/projects/crude/crude-website-desktop.webp",
      "altText": "Vista del inicio de la web Crude",
      "introText": "The project for Crude's online store consisted of a comprehensive design of an online store with a modern visual language, focusing on the user experience for both sales and brand building. For the technical development, the e-commerce platform WooCommerce and WordPress were used.",
      "imageAuxPathMobile": "/images/projects/crude/crude-website-aux-mobile.webp",
      "imageAuxPathDesktop": "/images/projects/crude/crude-website-aux-desktop.webp",
      "altTextAuxImage": "Página de producto de Crude",
      "role": "UX/UI, Frontend Dev",
      "tech": "Wordpress, Html, Scss, Javascript",
      "year": "2023",
      "dev": "The development process of Crude's online store was carried out in two phases. The design phase focused on creating a satisfying user experience with modern visual language. It was designed mobile-first, as the majority of users would access it through social media advertising.\n\nFor the technical development, the website was built on Wordpress and the store was developed using Woocommerce, which will allow users to access all products, and enable the brand to manage their content in an accessible way.",
      "challenges": "This has been the first project undertaken with Wordpress, so the main challenge of this project has been learning how to work with the tool itself. \n\nMoreover, how to structure the project has also been a challenge. Finding a compromise between the initial organization created and the one that Wordpress offers has been a continuous learning process.",
      "linkGithub": "https://github.com/franc333s/crude-shop"   
    },
    {
      "id": 2,
      "title": "Cuatro Cuatros",
      "slug": "cuatro-cuatros",
      "typeOfWork": "Frontend Dev",
      "description": "Cuatro Cuatros is a Product Design Studio from Valencia (SP) whose website needed to be updated. This website was designed by Cuatro Cuatros and developed by me in Wordpress to facilitate the client's management of their content",
      "linkToSite": "https://cuatrocuatros.com",
      "imagePathMobile": "/images/projects/cuatro-cuatros/cuatro-cuatros-website-mobile.webp",
      "imagePathDesktop": "/images/projects/cuatro-cuatros/cuatro-cuatros-website-desktop.webp",
      "altText": "Vista de la web de Cuatro Cuatros",
      "introText": "Cuatro Cuatros website has been a collaborative work with the studio itself, who handled the web design, while I undertook the web development part. For the development of this site, WordPress was chosen for its ease of content management for the client and the potential to convert it into an online store in the future.",
      "imageAuxPathMobile": "/images/projects/cuatro-cuatros/cuatro-cuatros-website-aux-mobile.webp",
      "imageAuxPathDesktop": "/images/projects/cuatro-cuatros/cuatro-cuatros-website-aux-desktop.webp",
      "altTextAuxImage": "Web de Cuatro Cuatros desarrollada por Marina Francés",
      "role": "Frontend Dev",
      "tech": "Wordpress, MAMP, Html, Scss, Javascript",
      "year": "2023",
      "dev": "The development process of the Cuatro Cuatros website has been executed in a single phase, where the web code was generated and implemented simultaneously within the PHP files of the WordPress structure. The project was initially developed locally using MAMP and then migrated to the final server.",
      "challenges": "The major challenge of this project has been undertaking a project with a client for the first time, which involves learning to manage a project from start to finish. \n\nAdditionally, due to the previous website being quite outdated, the change also entailed a complete update of the PHP, the inclusion of an SSL certificate, and other necessary details.",
      "linkGithub": "https://github.com/franc333s/cuatrocuatros-landing"
    },
    {
      "id": 3,
      "title": "Portfolio",
      "slug": "portfolio",
      "typeOfWork": "UX/UI + Frontend Dev",
      "description": "The design and development of this online portfolio has been my final project for ESAT's Postgraduate in Front-End Web Design and Development. This website has been my first project developed in React.",
      "linkToSite": "https://marina-frances-portfolio.netlify.app/",
      "imagePathMobile": "/images/projects/portfolio/portfolio-website-mobile.webp",
      "imagePathDesktop": "/images/projects/portfolio/portfolio-website-desktop.webp",
      "altText": "Porfolio de Marina Francés",
      "introText": "As my final project for the postgraduate program, I have developed a portfolio that showcases all the projects I have worked on so far. This project was designed using Figma and developed using React.",
      "imageAuxPathMobile": "/images/projects/portfolio/portfolio-website-aux-mobile.webp",
      "imageAuxPathDesktop": "/images/projects/portfolio/portfolio-website-aux-desktop.webp",
      "altTextAuxImage": "Porfolio de Marina Francés",
      "role": "UX/UI, Frontend Dev",
      "tech": "React, Scss",
      "year": "2023",
      "dev": "The development of the portfolio has been carried out simultaneously with the learning process of this technology in class. The website has been built using various components that are utilized in different parts of the web. Information on pages such as the home and about sections is static, but to ensure easy content maintenance, all the information on internal project pages is dynamically rendered from a JSON file.",
      "challenges": "The initial challenge of this project was the learning curve associated with the tool. However, it turned out to be an enjoyable process that wasn't overly complicated. While React can be complex, it is also accessible for beginners. \n\nAnother challenge I faced was maintaining a logical order within the code, particularly in organizing the components and Scss. Ensuring a well-structured codebase was an important aspect of the project.",
      "linkGithub": "https://github.com/franc333s/portfolio"
    },
    {
      "id": 4,
      "title": "About me",
      "slug": "about-me",
      "typeOfWork": "UX/UI + Frontend Dev",
      "description": "The first project undertaken during my postgraduate program at ESAT was to design and develop a flat HTML and CSS personal landing page. The objective of this project is to have an initial point of contact to showcase ourselves to companies.",
      "linkToSite": "https://astonishing-torte.netlify.app/",
      "imagePathMobile": "/images/projects/about-me/about-me-website-mobile.webp",
      "imagePathDesktop": "/images/projects/about-me/about-me-website-desktop.webp",
      "altText": "Vista del proyecto About Me de Marina Francés",
      "introText": "The About Me project is a plain HTML and CSS landing page designed as a self-introduction to send to companies when job seeking. This was also the first project we developed for the posgraduate program.",
      "imageAuxPathMobile": "/images/projects/about-me/about-me-website-aux-mobile.webp",
      "imageAuxPathDesktop": "/images/projects/about-me/about-me-website-aux-desktop.webp",
      "altTextAuxImage": "Vista del proyecto About Me de Marina Francés",
      "role": "UX/UI, Frontend",
      "tech": "Html, Css",
      "year": "2022",
      "dev": "The About Me project was our first assignment for the postgraduate program and involved developing a landing page where we could introduce ourselves. The project had two objectives: firstly, to provide an initial introduction to HTML and CSS, and secondly, to create a webpage that could be used as a self-introduction when applying to future companies.",
      "challenges": "This has been the first project undertaken with Wordpress, so the main challenge of this project has been learning how to work with the tool itself. \n\nMoreover, how to structure the project has also been a challenge. Finding a compromise between the initial organization created and the one that Wordpress offers has been a continuous challenge in maintaining order.",
      "linkGithub": "https://github.com/franc333s/project-alpha-about-me"
    },
    {
      "id": 5,
      "title": "Alutec",
      "slug": "alutec",
      "typeOfWork": "UI Design",
      "description": "Alutec was one of the first UI designs I carried out in my last job. For this website, we were looking for an image-based language that showcased the company's furniture catalog to potential buyers.",
      "linkToSite": "https://www.alutec.es/",
      "imagePathMobile": "/images/projects/alutec/alutec-website-mobile.webp",
      "imagePathDesktop": "/images/projects/alutec/alutec-website-desktop.webp",
      "altText": "Vista del inicio de la web Crude",
      "introText": "Alutec is a hospitality-focused company that specializes in outdoor and indoor furniture. They required a website to showcase their products, highlight projects featuring their furniture, and serve as an online catalog.",
      "imageAuxPathMobile": "/images/projects/alutec/alutec-website-aux-mobile.webp",
      "imageAuxPathDesktop": "/images/projects/alutec/alutec-website-aux-desktop.webp",
      "altTextAuxImage": "Página de producto de Crude",
      "role": "UI Design",
      "tech": "Wordpress",
      "year": "2019",
      "dev": "The web design process began with the design of the homepage, where we included the different elements that the client wanted to highlight: their products, the projects carried out with their products, and their social media activity. Once we finalized and received approval on the design, we focused on the user experience throughout the entire website and applied the UI design that the client had approved for the homepage.",
      "challenges": "Undertaking a design project for a design company is always a challenge as the client often has a more refined aesthetic sense. However, the understanding with the company was good, and the outcome was rewarding.",
      "linkGithub": ""
    }
]